tutorials/fluids/decayingTaylorGreenVortex/constant/dynamicMeshDict.orthogonal.moving
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;
solver          decayingTaylorGreenVortexMeshMotion;
decayingTaylorGreenVortexMeshMotionCoeffs
{
    // Motion scale factor
    //scaleFactor    0.1;
    scaleFactor    0.01;

    orthogonalMeshMotion yes;
}

// ************************************************************************* //
